ArsenyCheplyukov/STM32-Display_With-Menu/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "u8g2/u8g2.h"
#include <string.h>
#include "STM32F4xx.h"
#include <stm32f4xx_hal.h>
#include "menu.h"
#include <stdio.h>
#include <stdlib.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
uint8_t ButtonState = 0;
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
TIM_HandleTypeDef htim9;
TIM_HandleTypeDef htim10;
TIM_HandleTypeDef htim13;
TIM_HandleTypeDef htim14;

/* Definitions for rewriteDisplay */
osThreadId_t rewriteDisplayHandle;
const osThreadAttr_t rewriteDisplay_attributes = {
  .name = "rewriteDisplay",
  .stack_size = 2048 * 4,
  .priority = (osPriority_t) osPriorityRealtime7,
};
/* Definitions for buttonListen */
osThreadId_t buttonListenHandle;
const osThreadAttr_t buttonListen_attributes = {
  .name = "buttonListen",
  .stack_size = 1024 * 4,
  .priority = (osPriority_t) osPriorityBelowNormal,
};
/* USER CODE BEGIN PV */
// INPUT CAPTURE VARIABLES
//int64_t IC_Val1 = 0;
//int64_t IC_Val2 = 0;
int64_t Difference = 0;
uint8_t valid_for_capturing = 2;
//uint8_t Is_First_Captured = 0;
const uint64_t TIMCLOCK = 84000000; //168000000
const uint64_t COEFFICIENT = 1000000000;
const uint64_t translateus2Y = 1562;
///////////////////////////////////////////////////////////////////////////////////////////////////////

// METAL INDICATOR PARAMETERS
//const double min_gs_speed = 0.003; // obvious, no exact
//const double max_hss_speed = 0.009; // obvious, no exact
//const double max_gs_speed = 0.0049; // mm/ns
//const double min_hss_speed = 0.0055; // mm/ns

const double min_gs_speed = 0.0015; // obvious, no exact
const double max_hss_speed = 0.0045; // obvious, no exact
const double max_gs_speed = 0.00245; // mm/ns
const double min_hss_speed = 0.00275; // mm/ns

const uint32_t TEST_DELAY = 620;  // ns

///////////////////////////////////////////////////////////////////////////////////////////////////////

// ARRAY VARIABLES FOR CONST MEASURING LENGTH
const uint8_t array_size = 8;
int data_array[][6] = {
		{4, 8, 0, 0, 0, 0},
		{5, 6, 0, 0, 0, 0},
		{0, 0, 0, 0, 0, 0},
		{0, 0, 0, 0, 0, 0},
		{0, 0, 0, 0, 0, 0},
		{0, 0, 0, 0, 0, 0},
		{0, 0, 0, 0, 0, 0},
		{0, 0, 0, 0, 0, 0}
};
int32_t menu1position = 0;
const uint8_t max_menu_position = 5;

/////////////////////////////////////////////////////////////////////////////////////////////////////////

// MESSAGE VARIABLES IN CHANGING LENGTH MODE
int pointer_y_coordinate = 0;
char messages[][25] = {
		{"L1="},
		{"L2="},
		{"L3="},
		{"L4="},
		{"L5="},
		{"L6="},
		{"L7="},
		{"L8="},
};
char current_messages[][25] = {
		{"L1=480,000"},
		{"L2=560,000"},
		{"L3=000,000"},
		{"L4=000,000"},
		{"L5=000,000"},
		{"L6=000,000"},
		{"L7=000,000"},
		{"L8=000,000"},
};

/////////////////////////////////////////////////////////////////////////////////////////////////////////////

// GRAPH STATE VARIABLES
int current_multiplier_index = 4;
const int max_multiplier_index = 8;
double multiplier[] = {0.1, 0.25, 0.5, 0.75, 1.0, 1.5, 2.0, 4.0, 10};
char multiplier_names[][25] = {
		{"OX: 100mV"},
		{"OX: 250mV"},
		{"OX: 500mV"},
		{"OX: 750mV"},
		{"OX: 1V"},
		{"OX: 1,5V"},
		{"OX: 2V"},
		{"OX: 4V"},
		{"OX: 10V"},
};

int current_bias_index = 8;
int max_bias_index = 16;
int bias[] = {-64, -56, -48, -40, -32, -24, -16, -8, 0, 8, 16, 24, 32, 40, 48, 56, 64};
char bias_names[][25] = {
		{"Bias: 100%"},
		{"Bias: 87.5%"},
		{"Bias: 75%"},
		{"Bias: 62.5%"},
		{"Bias: 50%"},
		{"Bias: 37.5%"},
		{"Bias: 25%"},
		{"Bias: 12.5%"},
		{"Bias: 0%"},
		{"Bias: -12.5%"},
		{"Bias: -25%"},
		{"Bias: -37.5%"},
		{"Bias: -50%"},
		{"Bias: -62.5%"},
		{"Bias: -75%"},
		{"Bias: -87.5%"},
		{"Bias: -100%"},

};

const int line_points_max_index = 1024;
int line_points_x[1025] = {0};  // initialized in main
// readed values
int line_points_y[1025] = {0};

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// USER U8G2 VARIALBLE:
static u8g2_t u8g2;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_TIM10_Init(void);
static void MX_TIM9_Init(void);
static void MX_TIM13_Init(void);
static void MX_TIM14_Init(void);
void rewriteDisplayFunction(void *argument);
void buttonListenFunction(void *argument);

/* USER CODE BEGIN PFP */

// Example menu item specific enter callback function, run when the associated menu item is entered.
static void Level1Item2_Enter(void) {
	u8g2_SetFont(&u8g2, u8g2_font_ncenB14_tr);
	u8g2_FirstPage(&u8g2);
	do {
		u8g2_DrawStr(&u8g2, 0, 15, "ENTER");
	} while (u8g2_NextPage(&u8g2));
}

// Example menu item specific select callback function, run when the associated menu item is selected.
static void Item_Select_Callback(uint8_t x, uint8_t y) {
	u8g2_SetFont(&u8g2, u8g2_font_ncenB14_tr);
	u8g2_SetDrawColor(&u8g2, 1);	// change color of text (inverse)
	u8g2_DrawRBox(&u8g2, x, y, 100, 20, 8);	// draw frame
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////D

// DRAW DOTTED LINE
void u8g2_DrawDLine(u8g2_t *u8g2, u8g2_uint_t x1, u8g2_uint_t y1, u8g2_uint_t x2, u8g2_uint_t y2, u8g2_int_t d) {
	u8g2_uint_t tmp;
	u8g2_uint_t x,y;
	u8g2_uint_t dx, dy;
	u8g2_int_t err;
	u8g2_int_t ystep;
	uint8_t swapxy = 0;
	/* no intersection check at the moment, should be added... */
	if (x1>x2) dx=x1-x2; else dx=x2-x1;
	if (y1>y2) dy=y1-y2; else dy=y2-y1;
	if (dy>dx) {
		swapxy = 1;
		tmp=dx; dx=dy; dy=tmp;
		tmp=x1; x1=y1; y1=tmp;
		tmp=x2; x2=y2; y2=tmp;
	}
	if (x1>x2) tmp=x1, x1=x2, x2=tmp, tmp=y1, y1=y2, y2=tmp;
	err = dx >> 1;
	if (y2>y1) ystep = 1; else ystep = -1, y = y1;
	#ifndef  U8G2_16BIT
		if (x2 == 255) x2--;
	#else
		if (x2 == 0xffff) x2--;
	#endif
	for(x=x1; x<=x2; x++) {
		if (swapxy == 0) {
			if(d==0) {
				u8g2_DrawPixel(u8g2, x, y); /* solid line */
			} else if(d==1){
				if(x%2==0) u8g2_DrawPixel(u8g2, x, y); /* dotted line */
			} else if(d>1){
				if((x/d)%2==0) u8g2_DrawPixel(u8g2, x, y); /* dashed line */
			} else if(d<0){
				if((x/-d)%2!=0) u8g2_DrawPixel(u8g2, x, y); /* dashed line inverted */
			}
		} else {
			if(d==0) {
				u8g2_DrawPixel(u8g2, y, x); /* solid line */
			} else if(d==1){
				if(x%2==0) u8g2_DrawPixel(u8g2, y, x); /* dotted line */
			} else if(d>1){
				if((x/d)%2==0) u8g2_DrawPixel(u8g2, y, x); /* dashed line */
			} else if(d<0){
				if((x/-d)%2!=0) u8g2_DrawPixel(u8g2, y, x); /* dashed line inverted */
			}
		}
		err -= (uint8_t)dy;
		if (err<0) y += (u8g2_uint_t)ystep, err += (u8g2_uint_t)dx;
	}
}

