ArsenyCheplyukov/STM32-Display_With-Menu/Core/Src/main.c
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// DRAW GRAPH FOR CHANGING LENGTH POINT IN MENU (2ND)
uint64_t used_difference_ = 0;
uint8_t already_used_ = 0;
static void DrawGraphChangingLength(void) {
	u8g2_SetDrawColor(&u8g2, 1);
	u8g2_FirstPage(&u8g2);
	do {
		u8g2_DrawFrame(&u8g2, 10, 4, 220, 120); // x, y, w, h
		u8g2_SetFont(&u8g2, u8g2_font_10x20_t_cyrillic);
		u8g2_DrawStr(&u8g2, 115, 30, "?");
		// draw unicode symbols
		// horizontal lines:
		u8g2_DrawDLine(&u8g2, 10, 40, 229, 40, 1); // x1, y1, x2, y2
		u8g2_DrawDLine(&u8g2, 10, 110, 229, 110, 1); // x1, y1, x2, y2
		// vertical lines:
		u8g2_DrawDLine(&u8g2, 78, 4, 78, 40, 1); // x1, y1, x2, y2
		u8g2_DrawDLine(&u8g2, 162, 4, 162, 40, 1); // x1, y1, x2, y2
		if (!already_used_) {
			used_difference_ = 0;
			for (int i = 0; i <= line_points_max_index; ++i) {
				used_difference_ += line_points_y[i];
			}
			used_difference_ /= line_points_max_index+1;
			already_used_ = 1;
		}
		if (already_used_ && used_difference_) {
			u8g2_DrawUTF8(&u8g2, 30, 30, "СЧ");
			u8g2_DrawUTF8(&u8g2, 190, 30, "ВЧ");
			u8g2_DrawStr(&u8g2, 85, 80, " > L > ");
			u8g2_DrawUTF8(&u8g2, 35, 95, "мм");
			u8g2_DrawUTF8(&u8g2, 185, 95, "мм");
			char mes1[25];
			char mes2[25];
			double ans1 = used_difference_*max_gs_speed;
			double ans2 = used_difference_*min_hss_speed;
			if (ans1 && ans2) {
				sprintf(mes1, "%.2lf\n", ans1);
				u8g2_DrawUTF8(&u8g2, 20, 80, mes1);
				sprintf(mes2, "%.2lf\n", ans2);
				u8g2_DrawUTF8(&u8g2, 165, 80, mes2);
			}
			already_used_ = 0;
		}
	} while (u8g2_NextPage(&u8g2));
}

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//MENU ITEMS INITIALIZATION
//MENU_ITEM(Name, Next, Previous, Parent,    Child,     SelectFunc,           EnterFunc,         xPos,yPos, cursorWidth, cursorHeight, hasachild, Text)
MENU_ITEM(Menu_1, Menu_2, Menu_2, NULL_MENU, Menu_1_1,  Item_Select_Callback, Level1Item2_Enter,       0, 20,  240, 40, 1, "С неизменяющимся измеряемым -размером");
MENU_ITEM(Menu_2, Menu_1, Menu_1, NULL_MENU, NULL_MENU, Item_Select_Callback, DrawGraphChangingLength, 0, 60,  240, 40, 0, "С изменяющимся измеряемым -размером"); // DrawGraphChangingLength
//MENU_ITEM(Menu_3, Menu_1, Menu_2, NULL_MENU, NULL_MENU, Item_Select_Callback, NULL, 0, 100, 240, 40, 0, "График измерений");

MENU_ITEM(Menu_1_1, Menu_1_2, Menu_1_8, Menu_1, NULL_MENU, Item_Select_Callback, NULL, 5, 20, 110, 25, 0, current_messages[0]);
MENU_ITEM(Menu_1_2, Menu_1_3, Menu_1_1, Menu_1, NULL_MENU, Item_Select_Callback, NULL, 5, 45, 110, 25, 0, current_messages[1]);
MENU_ITEM(Menu_1_3, Menu_1_4, Menu_1_2, Menu_1, NULL_MENU, Item_Select_Callback, NULL, 5, 70, 110, 25, 0, current_messages[2]);
MENU_ITEM(Menu_1_4, Menu_1_5, Menu_1_3, Menu_1, NULL_MENU, Item_Select_Callback, NULL, 5, 95, 110, 25, 0, current_messages[3]);
MENU_ITEM(Menu_1_5, Menu_1_6, Menu_1_4, Menu_1, NULL_MENU, Item_Select_Callback, NULL, 5, 120, 110, 25, 0, current_messages[4]);
MENU_ITEM(Menu_1_6, Menu_1_7, Menu_1_5, Menu_1, NULL_MENU, Item_Select_Callback, NULL, 125, 20, 110, 25, 0, current_messages[5]);
MENU_ITEM(Menu_1_7, Menu_1_8, Menu_1_6, Menu_1, NULL_MENU, Item_Select_Callback, NULL, 125, 45, 110, 25, 0, current_messages[6]);
MENU_ITEM(Menu_1_8, Menu_1_1, Menu_1_7, Menu_1, NULL_MENU, Item_Select_Callback, NULL, 125, 70, 110, 25, 0, current_messages[7]);

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// FUNCTION FOR WRITE TEXT AND VALUES IN MENU ITEMS
static void Generic_Write(Menu_Item_t *currentMenuItem, Menu_Item_t *currentMenuLayerTopItem) {
	Menu_Item_t *bufptr = currentMenuLayerTopItem;
	u8g2_FirstPage(&u8g2);
	do {
		u8g2_SetDrawColor(&u8g2, 1);	// inverse color
		u8g2_DrawBox(&u8g2, currentMenuItem->xPos, currentMenuItem->yPos - 17, currentMenuItem->cursorWidth, currentMenuItem->cursorHeigth);	// select frame
		u8g2_SetFont(&u8g2, u8g2_font_unifont_t_cyrillic);	// set cyrillic font
		do {
			// if have same coordinates
			if (bufptr->yPos == currentMenuItem->yPos && bufptr->xPos == currentMenuItem->xPos) {
				u8g2_SetDrawColor(&u8g2, 0); // set ordinary text color
				uint8_t stringInterval = 0;
				char str[100];
				strcpy(str, (bufptr->Text)); // copy text from buffer
				const char s[2] = "-";
				char *token;
				token = strtok(str, s);
				while (token != NULL) {
					u8g2_DrawUTF8(&u8g2, bufptr->xPos, bufptr->yPos + stringInterval, token);
					token = strtok(NULL, s);
					stringInterval += 15;
				}
				u8g2_SetDrawColor(&u8g2, 1);
			} else {
				u8g2_SetDrawColor(&u8g2, 1); // set inverse text color
				uint8_t stringInterval = 0;
				char str[100];
				strcpy(str, (bufptr->Text));
				const char s[2] = "-";
				char *token;
				token = strtok(str, s);
				while (token != NULL) {
					u8g2_DrawUTF8(&u8g2, bufptr->xPos, bufptr->yPos + stringInterval, token);
					token = strtok(NULL, s);
					stringInterval += 15;
				}
			}
			bufptr = bufptr->Next;
			// IF FIRST MENU ITEM - DRAW UNDERLINE SYMBOLS
			if (Menu_GetCurrentMenu()->Parent == &Menu_1) {
				uint8_t index_ = 0;
				uint8_t row = 0;
				if (Menu_GetCurrentMenu() == &Menu_1_1) {
					index_ = 0, row = 0;
				} else if (Menu_GetCurrentMenu() == &Menu_1_2) {
					index_ = 1, row = 0;
				} else if (Menu_GetCurrentMenu() == &Menu_1_3) {
					index_ = 2, row = 0;
				} else if (Menu_GetCurrentMenu() == &Menu_1_4) {
					index_ = 3, row = 0;
				} else if (Menu_GetCurrentMenu() == &Menu_1_5) {
					index_ = 4, row = 0;
				} else if (Menu_GetCurrentMenu() == &Menu_1_6) {
					index_ = 0, row = 1;
				} else if (Menu_GetCurrentMenu() == &Menu_1_7) {
					index_ = 1, row = 1;
				} else if (Menu_GetCurrentMenu() == &Menu_1_8) {
					index_ = 2, row = 1;
				}
				u8g2_SetDrawColor(&u8g2, 0);
				if (row == 0) {
					if (menu1position <= 2) {
						u8g2_DrawHLine(&u8g2, 37+8*menu1position, 21+25*index_, 8);
						u8g2_DrawHLine(&u8g2, 37+8*menu1position, 22+25*index_, 8);
					} else {
						u8g2_DrawHLine(&u8g2, 45+8*menu1position, 21+25*index_, 8);
						u8g2_DrawHLine(&u8g2, 45+8*menu1position, 22+25*index_, 8);
					}
				} else if (row == 1){
					if (menu1position <= 2) {
						u8g2_DrawHLine(&u8g2, 157+8*menu1position, 21+25*index_, 8);
						u8g2_DrawHLine(&u8g2, 157+8*menu1position, 22+25*index_, 8);
					} else {
						u8g2_DrawHLine(&u8g2, 165+8*menu1position, 21+25*index_, 8);
						u8g2_DrawHLine(&u8g2, 165+8*menu1position, 22+25*index_, 8);
					}
				}
			}
		} while (bufptr != currentMenuLayerTopItem);
	} while (u8g2_NextPage(&u8g2));
}

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// TRANSFORM DOUBLE FROM data_array TO STRING
double double_string(int x) {
	int last_part = 0;
	for (int i = 5; i > 2; --i){
		last_part += data_array[x][i] * pow(10, 5-i);
	}
	int first_part = 0;
	for (int i = 0; i < 3; ++i) {
		first_part += data_array[x][i] * pow(10, 2-i);
	}
	return (double)first_part + (double)last_part/1000;
}

// ADD ELEMENT IN GRAPH (3 POINT IN START MENU)
void add_element(int a) {
	for (int i = 0; i < line_points_max_index; ++i) {
		line_points_y[i] = line_points_y[i+1];
	}
	line_points_y[line_points_max_index] = a;
}

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

