ArsenyCheplyukov/STM32-Display_With-Menu/Core/Src/main.c
// DISPLAY GRAPH WITH ADD POINT TO IT (3 POINT IN MAIN MENU)
static void displayGraphPoints() {
	// static counter for new drawing
	u8g2_SetDrawColor(&u8g2, 1);
	const int max_x_point = 220;
	const int max_y_point = 100;
	//write cursor
	int cursor_coordinate = 50-pointer_y_coordinate;
	u8g2_DrawHLine(&u8g2, 10, cursor_coordinate, max_x_point);
	// axis name and value
	u8g2_SetFont(&u8g2, u8g2_font_chikita_tf);
	u8g2_DrawStr(&u8g2, 10, 108, bias_names[current_bias_index]);
	u8g2_DrawStr(&u8g2, 100, 108, multiplier_names[current_multiplier_index]);
//	u8g2_DrawStr(&u8g2, 175, 108,"OX: 500 м�?");
	char mes1[6];
	char mes2[6];
	char mes3[6];
	char previous_message[25];
	char current_message[25];
	char pointer_message[25];
	itoa(line_points_y[line_points_max_index-1], mes1, 10);
	sprintf(previous_message, "Пред.: %s\n", mes1);
	itoa(line_points_y[line_points_max_index], mes2, 10);
	sprintf(current_message, "Тек.: %s\n", mes2);
	itoa(cursor_coordinate, mes3, 10);
	sprintf(pointer_message, "Указ.: %s\n", mes3);
	u8g2_DrawStr(&u8g2, 10, 118, previous_message);
	u8g2_DrawStr(&u8g2, 100, 118, current_message);
	u8g2_DrawStr(&u8g2, 175, 118, pointer_message);
	// draw frame
	u8g2_DrawFrame(&u8g2, 10, 0, max_x_point, max_y_point+1);
	// vertical lines for grid
	int x_steps = 14;
	for (int i = 1; i < x_steps; ++i) {
		u8g2_DrawDLine(&u8g2, i*15 + 15, 0, i*15 + 15, max_y_point, 1);
	}
	// horizontal lines for grid
	int y_steps = 6;
	for (int i = 1; i < y_steps; ++i) {
		u8g2_DrawDLine(&u8g2, 10, i*16 + 2, max_x_point+10, i*16 + 2, 1);
	}
	// main axises:
	u8g2_DrawVLine(&u8g2, 120, 0, max_y_point);
	u8g2_DrawHLine(&u8g2, 10, 50, max_x_point);

	// draw lines for point forward
	// INVERSED COORDINATES, BECAUSE POINT MEASURED FROM UPPER END
	for (int i = 10; i < max_x_point+10; ++i) {
		int start_y = max_y_point/2-(float)((line_points_y[i]/translateus2Y-max_y_point/2)*multiplier[current_multiplier_index]) + bias[current_bias_index];
		int end_y = max_y_point/2-(float)((line_points_y[i+1]/translateus2Y-max_y_point/2)*multiplier[current_multiplier_index]) + bias[current_bias_index];
		if ((start_y <= max_y_point) && (end_y <= max_y_point) && (start_y >= 0) && (end_y >= 0)) {
			u8g2_DrawLine(&u8g2, i, start_y, i+1, end_y);
		} else if ((start_y <= 0) && (end_y >= 0)) {
			u8g2_DrawLine(&u8g2, i, 0, i+1, end_y);
		} else if ((start_y >= 0) && (end_y <= 0)) {
			u8g2_DrawLine(&u8g2, i, start_y, i+1, 0);
		} else if ((start_y > max_y_point) && (start_y <= max_y_point)){
			u8g2_DrawLine(&u8g2, i, max_y_point, i+1, end_y);
		} else if (start_y <= max_y_point && start_y > max_y_point){
			u8g2_DrawLine(&u8g2, i, start_y, i+1, max_y_point);
		}
	}
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// DRAW OBJECT LENGTH LIMITS (2 MENU ITEM)
uint64_t used_difference = 0;
static void DrawStateConstatntLength() {
	uint8_t already_used = 0;
	u8g2_FirstPage(&u8g2);
	u8g2_SetDrawColor(&u8g2, 1);
	const int max_x_point = 220;
	const int max_y_point = 110;
	do {
		// draw frame
		u8g2_DrawFrame(&u8g2, 10, 10, max_x_point, max_y_point+1);
		u8g2_SetFont(&u8g2, u8g2_font_10x20_t_cyrillic);
		int index_ = 9;
		if (Menu_GetCurrentMenu() == &Menu_1_1) {
			index_ = 0;
		} else if (Menu_GetCurrentMenu() == &Menu_1_2) {
			index_ = 1;
		} else if (Menu_GetCurrentMenu() == &Menu_1_3) {
			index_ = 2;
		} else if (Menu_GetCurrentMenu() == &Menu_1_4) {
			index_ = 3;
		} else if (Menu_GetCurrentMenu() == &Menu_1_5) {
			index_ = 4;
		} else if (Menu_GetCurrentMenu() == &Menu_1_6) {
			index_ = 5;
		} else if (Menu_GetCurrentMenu() == &Menu_1_7) {
			index_ = 6;
		} else if (Menu_GetCurrentMenu() == &Menu_1_8) {
			index_ = 7;
		}
		if (index_ != 9) {
			char mes[25];
			sprintf(mes, "L = %d%d%d,%d%d%d мм", data_array[index_][0], data_array[index_][1], data_array[index_][2], data_array[index_][3], data_array[index_][4], data_array[index_][5]);
			u8g2_DrawUTF8(&u8g2, 50, 30, mes);
		}
		if (!already_used) {
			used_difference = 0;
			for (int i = 0; i <= 240; ++i) {
				used_difference += line_points_y[i];
			}
			used_difference /= 241;
			already_used = 1;
		}
		// draw frame
		u8g2_DrawFrame(&u8g2, 90, 40, 60, 30);
		double length = double_string(index_);
		double min_gs_length = min_gs_speed*used_difference;
		double max_hss_length = max_hss_speed*used_difference;
		double max_gs_length = max_gs_speed*used_difference;
		double min_hss_length = min_hss_speed*used_difference;
		if (used_difference) {
			if (length <= max_gs_length && length > min_gs_length) {
				u8g2_DrawUTF8(&u8g2, 110, 60, "СЧ");
			} else if (length >= min_hss_length && length < max_hss_length) {
				u8g2_DrawUTF8(&u8g2, 110, 60, "ВЧ");
			} else {
				u8g2_DrawUTF8(&u8g2, 115, 60, "?");
			}
		} else {
			u8g2_DrawUTF8(&u8g2, 115, 60, "?");
		}
		u8g2_DrawHLine(&u8g2, 10, 73, 220);
		char mes3[25];
		char mes4[25];
		sprintf(mes3, "СЧ: L<=%.3lfмм\n", max_gs_length);
		sprintf(mes4, "ВЧ: L>=%.3lfмм\n", min_hss_length);
		u8g2_DrawUTF8(&u8g2, 30, 90, mes3);
		u8g2_DrawUTF8(&u8g2, 30, 110, mes4);
	} while (u8g2_NextPage(&u8g2));
}

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// ALTERNATIVE SAFER DELAY FUNCTION FOR MICROSECONDS DELAY
void delay_us(uint8_t us) {
	__HAL_TIM_SET_COUNTER(&htim13, 0);  // set the counter value a 0
	while (__HAL_TIM_GET_COUNTER(&htim13) < us);
	// wait for the counter to reach the us input in the parameter
}

// U8G2 FUNCTION TO WORK PROPERLY (DISPLAY PINS ARE ASSIGNED HERE)
uint8_t u8g2_gpio_and_delay_stm32(U8X8_UNUSED u8x8_t *u8x8, U8X8_UNUSED uint8_t msg, U8X8_UNUSED uint8_t arg_int, U8X8_UNUSED void *arg_ptr) {
	switch (msg) {
		case U8X8_MSG_GPIO_AND_DELAY_INIT:
			HAL_GPIO_WritePin(WR1_GPIO_Port, WR1_Pin, 1);
			HAL_GPIO_WritePin(WR0_GPIO_Port, WR0_Pin, 1);
			osDelay(1);
			break;
		case U8X8_MSG_DELAY_100NANO:		// delay arg_int * 100 nano seconds
			delay_us(arg_int / 10);
			break;
		case U8X8_MSG_DELAY_10MICRO:		// delay arg_int * 10 micro seconds
			delay_us(arg_int * 10);
			break;
		case U8X8_MSG_DELAY_MILLI:			// delay arg_int * 1 milli second
			osDelay(arg_int);
			break;
		case U8X8_MSG_DELAY_NANO:			// delay arg_int * 1 milli second
			delay_us(arg_int / 1000);
			break;
		case U8X8_MSG_GPIO_D0:
			HAL_GPIO_WritePin(DB0_GPIO_Port, DB0_Pin, arg_int);
			break;
		case U8X8_MSG_GPIO_D1:
			HAL_GPIO_WritePin(DB1_GPIO_Port, DB1_Pin, arg_int);
			break;
		case U8X8_MSG_GPIO_D2:
			HAL_GPIO_WritePin(DB2_GPIO_Port, DB2_Pin, arg_int);
			break;
		case U8X8_MSG_GPIO_D3:
			HAL_GPIO_WritePin(DB3_GPIO_Port, DB3_Pin, arg_int);
			break;
		case U8X8_MSG_GPIO_D4:
			HAL_GPIO_WritePin(DB4_GPIO_Port, DB4_Pin, arg_int);
			break;
		case U8X8_MSG_GPIO_D5:
			HAL_GPIO_WritePin(DB5_GPIO_Port, DB5_Pin, arg_int);
			break;
		case U8X8_MSG_GPIO_D6:
			HAL_GPIO_WritePin(DB6_GPIO_Port, DB6_Pin, arg_int);
			break;
		case U8X8_MSG_GPIO_D7:
			HAL_GPIO_WritePin(DB7_GPIO_Port, DB7_Pin, arg_int);
			break;
		case U8X8_MSG_GPIO_DC:
			HAL_GPIO_WritePin(CD_GPIO_Port, CD_Pin, arg_int);
			break;					// used as E2 for the SED1520
		case U8X8_MSG_GPIO_E: // 72
			HAL_GPIO_WritePin(WR0_GPIO_Port, WR0_Pin, arg_int);
			break;
	}
	return 1;
}

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

