ArsenyCheplyukov/STM32-Display_With-Menu/Core/Src/main.c
  /*Configure GPIO pins : PB0 PB1 PB2 PB10
                           PB11 PB12 PB13 PB14
                           PB15 PB3 PB4 PB5
                           PB6 PB7 PB8 PB9 */
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_10
                          |GPIO_PIN_11|GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14
                          |GPIO_PIN_15|GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_5
                          |GPIO_PIN_6|GPIO_PIN_7|GPIO_PIN_8|GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pins : PG0 PG10 PG11 PG13
                           PG14 */
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_10|GPIO_PIN_11|GPIO_PIN_13
                          |GPIO_PIN_14;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : WR0_Pin DB7_Pin DB6_Pin DB5_Pin
                           DB4_Pin DB3_Pin DB2_Pin DB1_Pin
                           DB0_Pin WR1_Pin CD_Pin */
  GPIO_InitStruct.Pin = WR0_Pin|DB7_Pin|DB6_Pin|DB5_Pin
                          |DB4_Pin|DB3_Pin|DB2_Pin|DB1_Pin
                          |DB0_Pin|WR1_Pin|CD_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : COL1_Pin COL4_Pin COL3_Pin COL2_Pin */
  GPIO_InitStruct.Pin = COL1_Pin|COL4_Pin|COL3_Pin|COL2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : PD9 PD11 PD1 PD2
                           PD3 PD5 PD7 */
  GPIO_InitStruct.Pin = GPIO_PIN_9|GPIO_PIN_11|GPIO_PIN_1|GPIO_PIN_2
                          |GPIO_PIN_3|GPIO_PIN_5|GPIO_PIN_7;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : ROW5_Pin ROW4_Pin ROW1_Pin ROW3_Pin
                           ROW2_Pin */
  GPIO_InitStruct.Pin = ROW5_Pin|ROW4_Pin|ROW1_Pin|ROW3_Pin
                          |ROW2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/* USER CODE BEGIN Header_rewriteDisplayFunction */
/**
  * @brief  Function implementing the rewriteDisplay thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_rewriteDisplayFunction */
void rewriteDisplayFunction(void *argument)
{
  /* USER CODE BEGIN 5 */
//	u8g2_ClearBuffer(&u8g2);
//	u8g2_ClearDisplay(&u8g2);
  /* Infinite loop */
	for(;;){
	  switch(ButtonState) {
		// MOVE FORWARD IN MENU
		case 1:
			Menu_Navigate(Menu_GetCurrentMenu()->Next, Menu_GetCurrentLayerTopMenu()); // Next, Child, Parent, Previous
			ButtonState = 0;
			break;
		// MOVE BACKWARDS IN MENU
		case 2:
			Menu_Navigate(Menu_GetCurrentMenu()->Previous, Menu_GetCurrentLayerTopMenu()); // Next, Child, Parent, Previous
			ButtonState = 0;
			break;
		// MOVE IN CHILD ELEMENT, PROGRESS (FOR GRAPHS AND 2 MENU DETERMINATION BREAK U8G2 RULES)
		case 3:
//			if (Menu_GetCurrentMenu() == &Menu_3) {
//				u8g2_FirstPage(&u8g2);
//				do {
//					displayGraphPoints();
//				} while (u8g2_NextPage(&u8g2));
//				break;
//			} else
			if (Menu_GetCurrentMenu() == &Menu_2) {
				u8g2_FirstPage(&u8g2);
				do {
					DrawGraphChangingLength();
				} while (u8g2_NextPage(&u8g2));
				break;
			} else if (Menu_GetCurrentMenu()->Parent == &Menu_1) {
				u8g2_FirstPage(&u8g2);
				do {
					DrawStateConstatntLength();
				} while (u8g2_NextPage(&u8g2));
				break;
			} else {
				Menu_Navigate(Menu_GetCurrentMenu()->Child, Menu_GetCurrentLayerTopMenu()->Child); // Next, Child, Parent, Previous
			}
			ButtonState = 0;
			break;
		// MOVE INTO PARENT ELEMENT, GET BACK IN PROGRESSION
		case 4:
			Menu_Navigate(Menu_GetCurrentMenu()->Parent, Menu_GetCurrentLayerTopMenu()->Parent); // Next, Child, Parent, Previous
			ButtonState = 0;
			break;
		// IF GRAPH - MAKE SHARPER, ELSE IF FIRST MENU - MOVE CHANGEBLE POSITION TO LOWER
		case 5:
//			if (Menu_GetCurrentMenu() == &Menu_3) {
//				if(current_multiplier_index < max_multiplier_index) {
//					current_multiplier_index++;
//					u8g2_ClearBuffer(&u8g2);
//					u8g2_SendBuffer(&u8g2);
//				}
//				ButtonState = 3;
//			} else
			if (Menu_GetCurrentMenu()->Parent == &Menu_1) {
				if (menu1position < max_menu_position) {
					menu1position += 1;
				}
				ButtonState = 0;
			}
			break;
		// IF GRAPH - MAKE SMOOTHER, IF FIRST MENU - MOVE TO HIGHER POSITION
		case 6:
//			if (Menu_GetCurrentMenu() == &Menu_3) {
//				if (current_multiplier_index > 0) { // check if this is not equal to zero
//					current_multiplier_index--;
//					u8g2_ClearBuffer(&u8g2);
//					u8g2_SendBuffer(&u8g2);
//				}
//				ButtonState = 3;
//			} else
			if (Menu_GetCurrentMenu()->Parent == &Menu_1) {
				if (menu1position > 0) {
					menu1position -= 1;
				}
				ButtonState = 0;
			}
			break;
		// IF GRAPH - MOVE UP, THEN REDRAW
		case 7:
//			if (Menu_GetCurrentMenu() == &Menu_3) {
//				if (current_bias_index < max_bias_index) {
//					current_bias_index++;
//					u8g2_ClearBuffer(&u8g2);
//					u8g2_SendBuffer(&u8g2);
//				}
//				ButtonState = 3;
//			} else
			if (Menu_GetCurrentMenu()->Parent == &Menu_1) {
				int index_ = 9;
				if (Menu_GetCurrentMenu() == &Menu_1_1) {
					index_ = 0;
				} else if (Menu_GetCurrentMenu() == &Menu_1_2) {
					index_ = 1;
				} else if (Menu_GetCurrentMenu() == &Menu_1_3) {
					index_ = 2;
				} else if (Menu_GetCurrentMenu() == &Menu_1_4) {
					index_ = 3;
				} else if (Menu_GetCurrentMenu() == &Menu_1_5) {
					index_ = 4;
				} else if (Menu_GetCurrentMenu() == &Menu_1_6) {
					index_ = 5;
				} else if (Menu_GetCurrentMenu() == &Menu_1_7) {
					index_ = 6;
				} else if (Menu_GetCurrentMenu() == &Menu_1_8) {
					index_ = 7;
				}
				if (index_ != 9) {
					if (data_array[index_][menu1position] > 0) {
						data_array[index_][menu1position] -= 1;
					}
				}
				for (size_t i = 0; i < array_size; ++i) {
					sprintf(current_messages[i], " %s%d%d%d,%d%d%dмм", messages[i], data_array[i][0], data_array[i][1], data_array[i][2], data_array[i][3], data_array[i][4], data_array[i][5]);
				}
				ButtonState = 0;
			}
			break;
		// IF GRAPH - MOVE DOWN, THEN REDRAW
		case 8:
//			if (Menu_GetCurrentMenu() == &Menu_3) {
//				if (current_bias_index > 0) { // check if this is not equal to zero
//					current_bias_index--;
//					u8g2_ClearBuffer(&u8g2);
//					u8g2_SendBuffer(&u8g2);
//				}
//				ButtonState = 3;
//			} else
			if (Menu_GetCurrentMenu()->Parent == &Menu_1) {
				int index_ = 9;
				if (Menu_GetCurrentMenu() == &Menu_1_1) {
					index_ = 0;
				} else if (Menu_GetCurrentMenu() == &Menu_1_2) {
					index_ = 1;
				} else if (Menu_GetCurrentMenu() == &Menu_1_3) {
					index_ = 2;
				} else if (Menu_GetCurrentMenu() == &Menu_1_4) {
					index_ = 3;
				} else if (Menu_GetCurrentMenu() == &Menu_1_5) {
					index_ = 4;
				} else if (Menu_GetCurrentMenu() == &Menu_1_6) {
					index_ = 5;
				} else if (Menu_GetCurrentMenu() == &Menu_1_7) {
					index_ = 6;
				} else if (Menu_GetCurrentMenu() == &Menu_1_8) {
					index_ = 7;
				}
				if (index_ != 9) {
					if (data_array[index_][menu1position] < 9) {
						data_array[index_][menu1position] += 1;
					}
				}
				for (size_t i = 0; i < array_size; ++i) {
					sprintf(current_messages[i], " %s%d%d%d,%d%d%dмм", messages[i], data_array[i][0], data_array[i][1], data_array[i][2], data_array[i][3], data_array[i][4], data_array[i][5]);
				}
				ButtonState = 0;
			}
			break;
		// REDRAW
		case 0:
			Menu_Navigate(Menu_GetCurrentMenu(), Menu_GetCurrentLayerTopMenu());
			break;
		default:
			ButtonState = 0;
		}
		osDelay(10);
	}
  /* USER CODE END 5 */
}

