ArsenyCheplyukov/STM32-Display_With-Menu/Core/Src/main.c
/* USER CODE BEGIN Header_buttonListenFunction */
/**
* @brief Function implementing the buttonListen thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_buttonListenFunction */
void buttonListenFunction(void *argument)
{
  /* USER CODE BEGIN buttonListenFunction */
  /* Infinite loop */
		//0  1  2  3  {+1}
		//4  5  6  7  {+1}
		//8  9  10 11 {+1}
		//12 13 14 15 {+1}
		const int rows_count = 4;
		const int columns_count = 4;
		GPIO_TypeDef* row_ports[] = {ROW1_GPIO_Port, ROW2_GPIO_Port, ROW3_GPIO_Port, ROW4_GPIO_Port, ROW5_GPIO_Port};
		uint16_t row_pins[] = {ROW1_Pin, ROW2_Pin, ROW3_Pin, ROW4_Pin, ROW5_Pin};
		GPIO_TypeDef* column_ports[] = {COL1_GPIO_Port, COL2_GPIO_Port, COL3_GPIO_Port, COL4_GPIO_Port};
		uint16_t column_pins[] = {COL1_Pin, COL2_Pin, COL3_Pin, COL4_Pin};
		for(;;){
			for (int i = 0; i < columns_count; i++) {
				for (int j = 0; j < columns_count; j++) {
					HAL_GPIO_WritePin(column_ports[j], column_pins[j], (i==j) ? GPIO_PIN_RESET : GPIO_PIN_SET);  //Pull low
				}
				for (int j = 0; j < rows_count; j++) {
					if (HAL_GPIO_ReadPin(row_ports[j], row_pins[j]) == GPIO_PIN_RESET) {  // if the Col j is high
//						TIM9->CCR2 = 500;
						HAL_TIM_PWM_Start(&htim9, TIM_CHANNEL_1);
						while (HAL_GPIO_ReadPin(row_ports[j], row_pins[j]) == GPIO_PIN_RESET);
						ButtonState = j * rows_count + i + 1;
						HAL_TIM_PWM_Stop(&htim9, TIM_CHANNEL_1);
					}
				}
			}
		}
  /* USER CODE END buttonListenFunction */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM1 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */
//  if (htim->Instance == TIM4) {
//	HAL_TIM_PWM_Start(&htim13, TIM_CHANNEL_1);
//	//delay_us(1);
//	//HAL_GPIO_WritePin(Biased_A_PWM_GPIO_Port, Biased_A_PWM_Pin, GPIO_PIN_SET);
//  }
  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM1) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */
//  if (htim->Instance == TIM4) {
//	  is_period_started = 1;
//  }
  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
